In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/stats.csv")
df.head()

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA

In [4]:
mean1=df["Salary"].mean()
mean1

53500.0

In [6]:
sum1=df["Salary"].sum
sum1

<bound method Series.sum of 0    40000
1    32000
2    45000
3    54000
4    72000
5    62000
6    92000
7    55000
8    35000
9    48000
Name: Salary, dtype: int64>

In [7]:
max1=df["Salary"].max()
max1

92000

In [8]:
min1=df["Salary"].min()
min1

32000

In [9]:
count1=df["Salary"].count()
count1

10

In [11]:
median1=df["Salary"].median()
median1

51000.0

In [13]:
mode1=df["Salary"].mode()
mode1

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

In [19]:
countrywise_sum=df.groupby(["Country"]).sum()
countrywise_sum

         Salary
Country
Brazil   142000
Italy    172000
USA      221000

In [23]:
countrywise_count=df.groupby(["Country"]).count()
countrywise_count

         Name  Salary
Country
Brazil      3       3
Italy       3       3
USA         4       4

## Measure of Variability

In [21]:
var1=df["Salary"].var()
var1

332055555.5555556

In [22]:
std1=df["Salary"].std()
std1

18222.391598128816

## Measure of Symmetry

In [24]:
skew1=df.skew(axis=0,skipna=True)
skew1

Salary    1.021551
dtype: float64

## Covariance and Correlation

In [25]:
bw=pd.read_csv("Data/BirthWeight.csv")
bw

    Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0           1                     34.7                  1895
1           2                     36.0                  2030
2           3                     29.3                  1440
3           4                     40.1                  2835
4           5                     35.7                  3090
5           6                     42.4                  3827
6           7                     40.3                  3260
7           8                     37.3                  2690
8           9                     40.9                  3285
9          10                     38.3                  2920
10         11                     38.5                  3430
11         12                     41.4                  3657
12         13                     39.7                  3685
13         14                     39.7                  3345
14         15                     41.1                  3260
15         16                     38.0                  2680
16         17                     38.7                  2005

In [28]:
bw.set_index("Infant ID" ,inplace=True)

In [29]:
bw.head()

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                             34.7                  1895
2                             36.0                  2030
3                             29.3                  1440
4                             40.1                  2835
5                             35.7                  3090

In [30]:
bw.cov()

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 9.963824              1798.025
Birth Weight (Grams)                 1798.025000            485478.750

In [32]:
bw.corr(method="pearson")

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.817519
Birth Weight (Grams)                    0.817519              1.000000